Repository: omnimind-ai/ViaVera
Catalog: OmniBot/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 第 %lld 行不是有效的 TOTP 认证链接。请修正后重试，尚未导入任何账户。
source: Line %lld is not a valid TOTP authentication link. Fix it and try again. No accounts have been imported.
zh_hans: 第 %lld 行不是有效的 TOTP 认证链接。请修正后重试，尚未导入任何账户。

# 第 %lld 轮模型请求…
source: Model request, round %lld…
zh_hans: 第 %lld 轮模型请求…

# 第 %lld 项：%@
source: Item %lld: %@
zh_hans: 第 %lld 项：%@

# 等待中
source: Waiting
zh_hans: 等待中

# 等待你描述任务
source: Waiting for your task
zh_hans: 等待你描述任务

# 等待执行…
source: Waiting to run…
zh_hans: 等待执行…

# 管理健康、日历、通讯录与闹钟授权
source: Manage Health, Calendar, Contacts, and Alarms access
zh_hans: 管理健康、日历、通讯录与闹钟授权

# 管理健康、日历与通讯录授权
source: Manage Health, Calendar, and Contacts access
zh_hans: 管理健康、日历与通讯录授权

# 管理标签页，共 %lld 个
source: Manage tabs, %lld total
zh_hans: 管理标签页，共 %lld 个

# 类型
source: Type
zh_hans: 类型

# 系统
source: System
zh_hans: 系统

# 系统已结束后台执行时间，任务进度已保留。请回到应用重试。
source: The system ended background execution. Task progress has been saved. Return to the app to retry.
zh_hans: 系统已结束后台执行时间，任务进度已保留。请回到应用重试。

# 系统提示
source: System Prompt
zh_hans: 系统提示

# 系统未允许 Via Vera 完整访问%@，可前往系统设置修改。
source: Via Vera was not granted full access to %@. You can change this in System Settings.
zh_hans: 系统未允许 Via Vera 完整访问%@，可前往系统设置修改。

# 系统没有完成%@授权，请稍后重试。
source: Authorization for %@ did not complete. Try again later.
zh_hans: 系统没有完成%@授权，请稍后重试。

# 组件 ID 重复、无效或数量/嵌套层级超过上限。
source: A component ID is duplicated or invalid, or the component count or nesting depth exceeds the limit.
zh_hans: 组件 ID 重复、无效或数量/嵌套层级超过上限。

# 组件不能同时绑定两类状态。
source: A component cannot bind to both types of state.
zh_hans: 组件不能同时绑定两类状态。

# 组件引用了不存在的会话状态。
source: A component references session state that does not exist.
zh_hans: 组件引用了不存在的会话状态。

# 组件引用了不存在的动作：%@
source: A component references an action that does not exist: %@
zh_hans: 组件引用了不存在的动作：%@

# 组件引用了不存在的状态：%@
source: A component references state that does not exist: %@
zh_hans: 组件引用了不存在的状态：%@

# 组件标题过长。
source: A component title is too long.
zh_hans: 组件标题过长。

# 终端
source: Terminal
zh_hans: 终端

# 终端已结束
source: Terminal Ended
zh_hans: 终端已结束

# 终端操作
source: Terminal Actions
zh_hans: 终端操作

# 终端无法启动
source: Cannot Start Terminal
zh_hans: 终端无法启动

# 终端输入
source: Terminal Input
zh_hans: 终端输入

# 统计时段
source: Reporting Period
zh_hans: 统计时段

# 缓存写入 %@
source: Cache writes %@
zh_hans: 缓存写入 %@

# 缓存命中率 %lld%%，命中读取 %@
source: Cache hit rate %lld%%, cached reads %@
zh_hans: 缓存命中率 %lld%%，命中读取 %@

# 缓存读取
source: Cache Reads
zh_hans: 缓存读取

# 编辑
source: Edit
zh_hans: 编辑

# 编辑上一条消息
source: Edit the Last Message
zh_hans: 编辑上一条消息

# 编辑后的消息不能为空。
source: The edited message cannot be empty.
zh_hans: 编辑后的消息不能为空。

# 编辑这条消息
source: Edit This Message
zh_hans: 编辑这条消息

# 缺失组件会被默认选中，可一键安装并自动复检。
source: Missing components are selected by default. Install them together and verify automatically.
zh_hans: 缺失组件会被默认选中，可一键安装并自动复检。

# 网页正在载入
source: Loading page
zh_hans: 网页正在载入

# 置顶
source: Pin
zh_hans: 置顶

# 置顶窗口
source: Pin Window
zh_hans: 置顶窗口

# 聊天
source: Chat
zh_hans: 聊天

# 聊天背景
source: Chat Background
zh_hans: 聊天背景

# 聊天背景与显示效果
source: Chat background and display effects
zh_hans: 聊天背景与显示效果

# 背景图片不能超过 64 MB。
source: Background images cannot exceed 64 MB.
zh_hans: 背景图片不能超过 64 MB。

# 能力 %@ 的参数缺失或不受支持。
source: Capability %@ has missing or unsupported arguments.
zh_hans: 能力 %@ 的参数缺失或不受支持。

# 能力列表数据只能写入会话状态，不能复制到持久状态。
source: Capability list data can only be written to session state, not copied to persistent state.
zh_hans: 能力列表数据只能写入会话状态，不能复制到持久状态。

# 能力参数 %@ 的类型错误。
source: Capability argument %@ has the wrong type.
zh_hans: 能力参数 %@ 的类型错误。

# 能力未声明或操作不受支持：%@
source: Capability not declared or operation unsupported: %@
zh_hans: 能力未声明或操作不受支持：%@

# 能力结果只能写入已声明的对象类型会话状态。
source: Capability results can only be written to declared object-type session state.
zh_hans: 能力结果只能写入已声明的对象类型会话状态。

# 范围
source: Range
zh_hans: 范围

# 获取模型失败（HTTP %lld）：%@
source: Failed to fetch models (HTTP %lld): %@
zh_hans: 获取模型失败（HTTP %lld）：%@

# 表达式参数不足。
source: The expression has too few arguments.
zh_hans: 表达式参数不足。

# 表达式嵌套超过上限。
source: Expression nesting exceeds the limit.
zh_hans: 表达式嵌套超过上限。

# 解锁本工具的两步认证账户
source: Unlock this tool’s two-factor authentication accounts
zh_hans: 解锁本工具的两步认证账户

# 计算生成的字段超过上限。
source: The generated fields exceed the limit.
zh_hans: 计算生成的字段超过上限。

# 计算生成的文本超过 32 KB。
source: Generated text exceeds 32 KB.
zh_hans: 计算生成的文本超过 32 KB。

# 计算生成的集合超过 500 项。
source: The generated collection exceeds 500 items.
zh_hans: 计算生成的集合超过 500 项。

# 计算结果超出范围。
source: The result is out of range.
zh_hans: 计算结果超出范围。

# 计算结果超过数据上限。
source: The result exceeds the data limit.
zh_hans: 计算结果超过数据上限。

# 认证信息过长。
source: The authentication information is too long.
zh_hans: 认证信息过长。

# 认证参数无效。
source: Invalid authentication parameters.
zh_hans: 认证参数无效。

# 认证账户格式无效，请检查账户、密钥、位数和周期。
source: Invalid authentication account. Check the account, secret, digits, and period.
zh_hans: 认证账户格式无效，请检查账户、密钥、位数和周期。

# 认证链接中的服务商信息不一致。
source: The issuer information in the authentication link is inconsistent.
zh_hans: 认证链接中的服务商信息不一致。

# 认证链接包含重复或空参数。
source: The authentication link contains duplicate or empty parameters.
zh_hans: 认证链接包含重复或空参数。

# 认证链接参数不受支持。
source: The authentication link contains unsupported parameters.
zh_hans: 认证链接参数不受支持。

# 让 AI 修改
source: Edit with AI
zh_hans: 让 AI 修改

# 让想法成为工具
source: Turn Ideas into Tools
zh_hans: 让想法成为工具

# 记忆
source: Memory
zh_hans: 记忆

# 设置
source: Settings
zh_hans: 设置

# 该会话可能已被删除，请从侧边栏选择其他会话。
source: This conversation may have been deleted. Select another from the sidebar.
zh_hans: 该会话可能已被删除，请从侧边栏选择其他会话。

# 该技能声明为 Android 专用，无法导入 Apple 版本。
source: This skill is Android-only and cannot be imported into the Apple version.
zh_hans: 该技能声明为 Android 专用，无法导入 Apple 版本。

# 该技能已经位于 OmniBot 的权威目录中。
source: This skill is already in OmniBot’s authoritative directory.
zh_hans: 该技能已经位于 OmniBot 的权威目录中。

# 该服务商可能已被删除。
source: This provider may have been deleted.
zh_hans: 该服务商可能已被删除。

# 该组件不支持子组件。
source: This component does not support child components.
zh_hans: 该组件不支持子组件。

# 该记录已不存在，请重新打开工具。
source: This record no longer exists. Reopen the tool.
zh_hans: 该记录已不存在，请重新打开工具。

# 说明
source: Description
zh_hans: 说明

# 请一次只识别一个内容不超过 32 KB 的二维码。
source: Scan one QR code at a time, with content no larger than 32 KB.
zh_hans: 请一次只识别一个内容不超过 32 KB 的二维码。

# 请为当前服务商填写 API Key。
source: Enter an API key for the current provider.
zh_hans: 请为当前服务商填写 API Key。

# 请先为设备设置解锁密码，再使用两步认证。
source: Set a device passcode before using two-factor authentication.
zh_hans: 请先为设备设置解锁密码，再使用两步认证。

# 请先在 Skills 中启用「%@」，或移除输入框中的 Skill 引用。
source: Enable “%@” in Skills first, or remove its reference from the composer.
zh_hans: 请先在 Skills 中启用「%@」，或移除输入框中的 Skill 引用。

# 请先在 Skills 中启用「原生工具制作」。
source: Enable the native tool builder in Skills first.
zh_hans: 请先在 Skills 中启用「原生工具制作」。

# 请先在 Via Vera 的“设置 > 系统 > 权限”中打开%@开关。
source: Enable %@ in Via Vera’s Settings > System > Permissions first.
zh_hans: 请先在 Via Vera 的“设置 > 系统 > 权限”中打开%@开关。

# 请先在系统设置中允许 Via Vera 访问%@。
source: Allow Via Vera to access %@ in System Settings first.
zh_hans: 请先在系统设置中允许 Via Vera 访问%@。

# 请先在输入框中选择模型。
source: Select a model in the composer first.
zh_hans: 请先在输入框中选择模型。

# 请先填写 API Key，再自动获取模型。
source: Enter an API key before fetching models.
zh_hans: 请先填写 API Key，再自动获取模型。

# 请先完成当前系统操作。
source: Complete the current system operation first.
zh_hans: 请先完成当前系统操作。

# 请分析 /workspace 中的项目结构，并告诉我最值得先处理的问题。
source: Analyze the project structure in /workspace and tell me which issues are most worth addressing first.
zh_hans: 请分析 /workspace 中的项目结构，并告诉我最值得先处理的问题。

# 请在本地 Alpine 中执行以下任务：
source: Run the following task in the local Alpine environment:
zh_hans: 请在本地 Alpine 中执行以下任务：

# 请在系统设置中允许 Via Vera 使用相机，或返回后从图片、TXT 文件导入。
source: Allow Via Vera to use the camera in System Settings, or go back and import an image or TXT file.
zh_hans: 请在系统设置中允许 Via Vera 使用相机，或返回后从图片、TXT 文件导入。

# 请改用当前平台已公开的工具。
source: Use the tools available on the current platform instead.
zh_hans: 请改用当前平台已公开的工具。

# 请根据当前工作区内容整理一份可长期复用的项目记忆。
source: Organize the current workspace information into reusable, long-term project memory.
zh_hans: 请根据当前工作区内容整理一份可长期复用的项目记忆。

# 请求失败，准备第 %lld 次尝试…
source: Request failed. Preparing attempt %lld…
zh_hans: 请求失败，准备第 %lld 次尝试…

# 请求已取消
source: Request cancelled
zh_hans: 请求已取消

# 请稍后重试。
source: Try again later.
zh_hans: 请稍后重试。

# 请输入 Agent 使用的模型 ID。
source: Enter the model ID for the agent.
zh_hans: 请输入 Agent 使用的模型 ID。

# 请输入 API Key
source: Enter an API key
zh_hans: 请输入 API Key

# 请输入新的会话名称。
source: Enter a new name for this conversation.
zh_hans: 请输入新的会话名称。

# 请输入有效数字。
source: Enter a valid number.
zh_hans: 请输入有效数字。

# 请输入有效的 HTTPS API Base URL；仅本机回环地址可使用 HTTP。
source: Enter a valid HTTPS API Base URL. HTTP is only allowed for loopback addresses.
zh_hans: 请输入有效的 HTTPS API Base URL；仅本机回环地址可使用 HTTP。

# 请输入服务商名称
source: Enter a provider name
zh_hans: 请输入服务商名称

# 请输出 Base URL
source: Enter a Base URL
zh_hans: 请输出 Base URL

# 请选择 UTF-8 或带 BOM 的 UTF-16 文本。
source: Select UTF-8 text or UTF-16 text with a BOM.
zh_hans: 请选择 UTF-8 或带 BOM 的 UTF-16 文本。

# 请选择不超过 1 MB 的文件。
source: Select a file no larger than 1 MB.
zh_hans: 请选择不超过 1 MB 的文件。

# 请选择不超过 256 KB 的 JSON 工具包。
source: Select a JSON tool package no larger than 256 KB.
zh_hans: 请选择不超过 256 KB 的 JSON 工具包。

# 请选择包含 SKILL.md 的目录，或直接选择 SKILL.md 文件：%@
source: Select a folder containing SKILL.md, or select SKILL.md directly: %@
zh_hans: 请选择包含 SKILL.md 的目录，或直接选择 SKILL.md 文件：%@

# 请选择有效的图片文件。
source: Select a valid image file.
zh_hans: 请选择有效的图片文件。

# 请选择需要安装的组件
source: Select components to install
zh_hans: 请选择需要安装的组件

# 请重新启动应用，Rootfs 将恢复为内置状态。
source: Restart the app to restore the bundled rootfs.
zh_hans: 请重新启动应用，Rootfs 将恢复为内置状态。

# 读取、创建和管理日历事件
source: Read, create, and manage calendar events
zh_hans: 读取、创建和管理日历事件

# 读取你明确授权的健康与健身数据
source: Read the health and fitness data you authorize
zh_hans: 读取你明确授权的健康与健身数据

# 账户 ID 无效。
source: Invalid account ID.
zh_hans: 账户 ID 无效。

# 账户已锁定，请重新解锁。
source: Accounts are locked. Unlock them again.
zh_hans: 账户已锁定，请重新解锁。

# 账户数量超过上限或 ID 重复。
source: There are too many accounts or duplicate IDs.
zh_hans: 账户数量超过上限或 ID 重复。

# 跟随系统
source: System
zh_hans: 跟随系统

# 软件源
source: Package Repository
zh_hans: 软件源

# 输入
source: Input
zh_hans: 输入

# 输入中包含 %@ Token 缓存写入
source: Input includes %@ cache write tokens
zh_hans: 输入中包含 %@ Token 缓存写入

# 输入模态
source: Input Modalities
zh_hans: 输入模态

# 输入组件与绑定状态的类型不匹配。
source: The input component type does not match the bound state.
zh_hans: 输入组件与绑定状态的类型不匹配。

# 输入组件必须绑定状态。
source: Input components must bind to state.
zh_hans: 输入组件必须绑定状态。

# 输入网址
source: Enter a URL
zh_hans: 输入网址

# 输入要交给本地 Agent 的任务，使用右侧发送按钮开始运行
source: Enter a task for the local agent, then use the send button on the right to run it
zh_hans: 输入要交给本地 Agent 的任务，使用右侧发送按钮开始运行

# 输入要交给本地 Agent 的任务，按 Enter 发送，按 Shift-Enter 换行
source: Enter a task for the local agent. Press Enter to send or Shift-Enter for a new line
zh_hans: 输入要交给本地 Agent 的任务，按 Enter 发送，按 Shift-Enter 换行

# 输入需要长期保留的事实、偏好或工作约定
source: Enter facts, preferences, or working agreements to remember
zh_hans: 输入需要长期保留的事实、偏好或工作约定

# 输出
source: Output
zh_hans: 输出

# 输出 %@
source: Output %@
zh_hans: 输出 %@

# 运算 %@ 参数数量不正确。
source: Operation %@ has an incorrect argument count.
zh_hans: 运算 %@ 参数数量不正确。

# 运算名称或参数无效。
source: Invalid operation name or arguments.
zh_hans: 运算名称或参数无效。

# 运行中
source: Running
zh_hans: 运行中

# 运行失败
source: Run Failed
zh_hans: 运行失败

# 近 %lld 天
source: Last %lld Days
zh_hans: 近 %lld 天

# 还没有会话
source: No Conversations Yet
zh_hans: 还没有会话

# 还没有可用模型
source: No Models Available Yet
zh_hans: 还没有可用模型

# 还没有模型服务
source: No Model Providers Yet
zh_hans: 还没有模型服务

# 还没有结果
source: No Results Yet
zh_hans: 还没有结果

# 这个时段还没有对话
source: No Conversations in This Period
zh_hans: 这个时段还没有对话

# 这个月
source: This Month
zh_hans: 这个月

# 这周
source: This Week
zh_hans: 这周

# 这里的内容会加入每次 Agent 运行的系统提示。
source: This content is included in the system prompt for every agent run.
zh_hans: 这里的内容会加入每次 Agent 运行的系统提示。

# 进度
source: Progress
zh_hans: 进度

# 退格
source: Backspace
zh_hans: 退格

# 选中日期
source: Selected Date
zh_hans: 选中日期

# 选择
source: Select
zh_hans: 选择

# 选择二维码图片
source: Select a QR Code Image
zh_hans: 选择二维码图片

# 选择器选项或初始值无效。
source: Picker options or the initial value are invalid.
zh_hans: 选择器选项或初始值无效。

# 选择模型
source: Select Model
zh_hans: 选择模型

# 选择模型或打开模型配置
source: Select a model or open model configuration
zh_hans: 选择模型或打开模型配置

# 选择背景图片
source: Choose Background Image
zh_hans: 选择背景图片

# 选择设置项目
source: Select a Settings Category
zh_hans: 选择设置项目

# 透明度
source: Opacity
zh_hans: 透明度

# 通讯录
source: Contacts
zh_hans: 通讯录

# 部分历史消息未记录模型，已归入“未记录模型”。
source: Some older messages have no model recorded and are grouped under “Unrecorded Model”.
zh_hans: 部分历史消息未记录模型，已归入“未记录模型”。

# 配置模型服务
source: Configure Model Providers
zh_hans: 配置模型服务

# 重命名会话
source: Rename Conversation
zh_hans: 重命名会话

# 重新加载
source: Reload
zh_hans: 重新加载

# 重新尝试
source: Try Again
zh_hans: 重新尝试

# 重新检测
source: Check Again
zh_hans: 重新检测

# 重新载入
source: Reload
zh_hans: 重新载入

# 重置 Rootfs
source: Reset Rootfs
zh_hans: 重置 Rootfs

# 重置 Rootfs 系统？
source: Reset the Rootfs System?
zh_hans: 重置 Rootfs 系统？

# 重置会移除 Alpine Linux 中安装的软件包和系统配置，但不会删除工作区文件。
source: Resetting removes packages and system settings installed in Alpine Linux. Workspace files are kept.
zh_hans: 重置会移除 Alpine Linux 中安装的软件包和系统配置，但不会删除工作区文件。

# 重置将在下次启动应用时生效，并恢复为应用内置的 Alpine Linux 系统。工作区文件会被保留。
source: The reset takes effect the next time the app starts and restores the bundled Alpine Linux system. Workspace files are kept.
zh_hans: 重置将在下次启动应用时生效，并恢复为应用内置的 Alpine Linux 系统。工作区文件会被保留。

# 重试
source: Retry
zh_hans: 重试

# 重试这条消息
source: Retry This Message
zh_hans: 重试这条消息

# 长期记忆
source: Long-term Memory
zh_hans: 长期记忆

# 长期记忆、每日记忆与检索
source: Long-term memory, daily memory, and search
zh_hans: 长期记忆、每日记忆与检索

# 长期记忆会在不同会话之间持续生效。
source: Long-term memory remains available across conversations.
zh_hans: 长期记忆会在不同会话之间持续生效。

# 闹钟
source: Alarms
zh_hans: 闹钟

# 附件：%@ 工作区路径：%@
source: Attachment: %@ Workspace path: %@
zh_hans: 附件：%@ 工作区路径：%@

# 除数不能为零。
source: Cannot divide by zero.
zh_hans: 除数不能为零。

# 隐藏
source: Hidden
zh_hans: 隐藏

# 隐藏 API Key
source: Hide API Key
zh_hans: 隐藏 API Key

# 隐藏模型
source: Hide Model
zh_hans: 隐藏模型

# 隐藏的模型不会出现在模型选择器中。
source: Hidden models do not appear in the model picker.
zh_hans: 隐藏的模型不会出现在模型选择器中。

# 集合中的每条记录必须具有唯一的字符串 id。
source: Each record in a collection must have a unique string id.
zh_hans: 集合中的每条记录必须具有唯一的字符串 id。

# 集合动作需要数组状态。
source: Collection actions require array state.
zh_hans: 集合动作需要数组状态。

# 非缓存输入
source: Uncached Input
zh_hans: 非缓存输入

# 音频输入
source: Audio Input
zh_hans: 音频输入

# 页面
source: Page
zh_hans: 页面

# 页面 ID 无效或重复。
source: A screen ID is invalid or duplicated.
zh_hans: 页面 ID 无效或重复。

# 页面、状态、动作数量或能力声明不受支持。
source: The number of screens, states, or actions, or the capability declarations, is unsupported.
zh_hans: 页面、状态、动作数量或能力声明不受支持。

# 页面需要标题和至少一个组件。
source: Screens require a title and at least one component.
zh_hans: 页面需要标题和至少一个组件。

# 预览 · %@
source: Preview · %@
zh_hans: 预览 · %@

# 预览文件
source: Preview File
zh_hans: 预览文件

# 预计新增 %lld 个账户，跳过 %lld 个重复账户。
source: Ready to add %lld accounts and skip %lld duplicates.
zh_hans: 预计新增 %lld 个账户，跳过 %lld 个重复账户。

# 颜色由浅到深表示消息数量由少到多
source: Colors from light to dark indicate increasing message counts
zh_hans: 颜色由浅到深表示消息数量由少到多

# 首次同步后显示可恢复的备份。
source: Recoverable backups appear after the first sync.
zh_hans: 首次同步后显示可恢复的备份。

# 验证码时间或参数无效。
source: Invalid authentication code time or parameters.
zh_hans: 验证码时间或参数无效。

# 验证码账户未能保存，请重新解锁后重试。
source: Authentication accounts could not be saved. Unlock them again and retry.
zh_hans: 验证码账户未能保存，请重新解锁后重试。

# 验证码账户未能保存。请确认设备已设置解锁密码。
source: Authentication accounts could not be saved. Make sure a device passcode is set.
zh_hans: 验证码账户未能保存。请确认设备已设置解锁密码。

# 黑夜
source: Dark
zh_hans: 黑夜
